app/controllers/jobs_controller.rb

  def index
     @search = Job.search(params[:search])
     @jobs = @search.all#.collect { |j| j.attributes.merge "position_type" => j.jobtype.job_type  }
---
SELECT * FROM `jobtypes` WHERE (`jobtypes`.`id` = 1)