app/controllers/jobtypes_controller.rb

SELECT * FROM `jobtypes`
---
  def index
    @jobtype = Jobtype.all