app/controllers/manage_controller.rb

    def edit_resume
      @resumes = Resume.all
---
SELECT * FROM `resumes`

    def resume_an(options={ })
      steady_options = { :order => params[:order], :offset => params[:offset], :limit => params[:limit] }
      options        = steady_options.merge(options)
      count          = ResumeAns.count
      records        = ResumeAns.scoped(options)
      @resume_ans    = []
      records.all.each do |res_an|
---
SELECT * FROM `resume_ans`

    def find_resume_an
      @resume_ans_n = ResumeAns.find(params[:id])
      render_json @resume_ans_n.to_a
---
SELECT * FROM `resume_ans` WHERE (rsex_a='g'and rexp_a='sunt')
SELECT * FROM `resume_ans`