app/controllers/papers_controller.rb

  def index
    papers = Group.find(:all)

    papers.collect! do |paper|
---
SELECT * FROM `groups`

  def create
    pDatas = params[:pDatas]
    gbIds = pDatas[:qbIds]
    jobId = pDatas[:jobId]
    newGroup = Group.create!(jobId)

    gbIds.each do |gbId|
      gbId.merge!({ :group_id => newGroup.id })
    end
    GroupsQuestions.create(gbIds)
---
INSERT INTO `groups` (`created_at`, `updated_at`, `gque`, `job_id`, `active`) VALUES('2010-11-11 13:58:32', '2010-11-11 13:58:32', NULL, 3, 0)
INSERT INTO `groups_questions` (`question_id`, `created_at`, `updated_at`, `group_id`) VALUES(1, '2010-11-11 13:58:32', '2010-11-11 13:58:32', 1)

  def show_questions
    oldPaper = Group.find(params[:id])
---
SELECT * FROM `groups` WHERE (`groups`.`id` = 1)

  def be_active
    beActiver = Group.find(params[:id])
    actives = Group.job_unactivelize(params[:job_id])
    beActiver.update_attributes({ :active => true })
---
SELECT * FROM `groups` WHERE (`groups`.`id` = 1)
UPDATE `groups` SET `updated_at` = '2010-11-11 13:58:43', `active` = 1 WHERE `id` = 1