app/controllers/persons_controller.rb

  def index
    @resume = Resume.first
---
SELECT * FROM `resumes` LIMIT 1