app/controllers/questions_controller.rb

  def create
    question = params[:question]
    Question.create!(question)
---
INSERT INTO `questions` (`created_at`, `qjug`, `updated_at`, `qcon`) VALUES('2010-11-11 13:55:12', NULL, '2010-11-11 13:55:12', '灰色轨迹')

  def deletes
    questions = params[:question_ids]
    Question.delete(questions)
---
DELETE FROM `questions` WHERE (`id` IN (NULL))